TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_Фрахт/гкс_Фрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_Фрахт</name>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ПланыРазгрузкиСудов</registerRecords>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.гкс_СтатусыСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацийФрахта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбработкиСудна</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОчередностьОбработки</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропорцияСмешивания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПланыРазгрузкиСудов/гкс_ПланыРазгрузкиСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПланыРазгрузкиСудов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трюм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияТранспортныхСредств/гкс_СостоянияТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияТранспортныхСредств</name>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_Фрахт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("МорскаяЛогистика");
		
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка, ДокументОбъект - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение: см. гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.гкс_Фрахт") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаПланыРазгрузкиСудов(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаСостоянияФрахта(ТекстыЗапроса, Регистры);
				
	КонецЕсли;
	
	// Получим таблицы для движений
	ДанныеДокументаДляПроведения = гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(
		Запрос, ТекстыЗапроса, ДопПараметры);
		
	ПодготовитьДанныеПоПланамРазгрузкиСудов(Запрос, ДанныеДокументаДляПроведения);
	
	Возврат ДанныеДокументаДляПроведения;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Подробней См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
// 
//  Параметры:
//   Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры)
	
	МенеджерВременныхТаблиц = Неопределено;
	
	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда
		
		МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено,
			Новый МенеджерВременныхТаблиц,
			МенеджерВременныхТаблиц);
		
	Иначе
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ПустаяДата", гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата());
	ПодготовитьДанныеДокумента(Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументШапка.Период КАК Период
	|ИЗ
	|	ФрахтШапка КАК ДокументШапка";
	ДанныеШапки = Запрос.Выполнить().Выгрузить()[0];
	ШапкаДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеШапки);
	Для Каждого КлючИЗначение Из ШапкаДокумента Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьДанныеДокумента(Запрос)
	
	Запрос.Текст = ТекстЗапросаДанныеДокумента();
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьДанныеПоПланамРазгрузкиСудов(Запрос, ДанныеДокументаДляПроведения)
	
	Перем ТаблицаДвижений, СтрокаДвижения;
	
	Если Не ДанныеДокументаДляПроведения.Свойство("Таблицагкс_ПланыРазгрузкиСудов", ТаблицаДвижений) Тогда 
		Возврат;
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаДанныеПоРазгрузкеСудна(НомераТаблиц);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОчередностьОбработки 	= РезультатЗапроса[НомераТаблиц.ОчередностьОбработки].Выгрузить();
	СкладыДокумента 		= РезультатЗапроса[НомераТаблиц.Склады].Выгрузить();
	Если СкладыДокумента.Количество() = 0 Тогда
		СкладыДокумента.Добавить();
	КонецЕсли;
	
	Выборка = РезультатЗапроса[НомераТаблиц.ПланРазгрузкиСудна].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОчередностьОбработкиТрюма = ОчередностьОбработки.Скопировать(
			Новый Структура("ИдентификаторСтрокиПОС", Выборка.ИдентификаторСтроки));
		ПорядокВыгрузки = ВыделитьЗначениеИзОчередностиОбработки(ОчередностьОбработкиТрюма, "Порядок");
		ПричалВыгрузки 	= ВыделитьЗначениеИзОчередностиОбработки(ОчередностьОбработкиТрюма, "Причал");
		
		СкладыТрюма 	= СкладыДокумента.НайтиСтроки(Новый Структура("Трюм", Выборка.Трюм));
		Если СкладыТрюма.Количество() = 0 Тогда
			СкладыТрюма = СкладыДокумента;
		КонецЕсли;
		
		РаспределилиПоСкладам 	= 0;
		Для Каждого СтрокаСклада Из СкладыТрюма Цикл
			
			// TODO: переопределить алгоритм расчета после согласования с командой МЛ
			ПропорцияСмешивания = ?(ЗначениеЗаполнено(СтрокаСклада.ПропорцияСмешивания), 
				СтрокаСклада.ПропорцияСмешивания, 1 / СкладыТрюма.Количество());
			СтрокаДвижения = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижения, Выборка);
			СтрокаДвижения.Склад		= СтрокаСклада.Склад;
			СтрокаДвижения.Количество 	= Выборка.Количество * ПропорцияСмешивания;
			РаспределилиПоСкладам 		= РаспределилиПоСкладам + СтрокаДвижения.Количество;
			СтрокаДвижения.Порядок 		= ПорядокВыгрузки;
			СтрокаДвижения.Причал 		= ПричалВыгрузки;
			
		КонецЦикла;
		
		Если Не РаспределилиПоСкладам = Выборка.Количество Тогда 
			СтрокаДвижения = ТаблицаДвижений[ТаблицаДвижений.Количество() - 1];
			СтрокаДвижения.Количество = СтрокаДвижения.Количество + Выборка.Количество - РаспределилиПоСкладам;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыделитьЗначениеИзОчередностиОбработки(ОчередностьОбработки, ИмяКолонки)
	
	КоллекцияЗначений	= ОчередностьОбработки.ВыгрузитьКолонку(ИмяКолонки);
	КоллекцияЗначений	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(КоллекцияЗначений);
	Возврат СтрСоединить(КоллекцияЗначений, " ,");
	
КонецФункции

Функция ТекстЗапросаДанныеДокумента()
	
	Возврат
	"ВЫБРАТЬ
	|	ФрахтШапка.Дата КАК Период,
	|	ФрахтШапка.ДатаУбытия КАК ДатаУбытия
	|ПОМЕСТИТЬ ФрахтШапка
	|ИЗ
	|	Документ.гкс_Фрахт КАК ФрахтШапка
	|ГДЕ
	|	ФрахтШапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФрахтГрузы.Номенклатура КАК Номенклатура,
	|	ФрахтГрузы.Количество КАК Количество,
	|	ФрахтГрузы.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса
	|ПОМЕСТИТЬ ФрахтГрузы
	|ИЗ
	|	Документ.гкс_Фрахт.Грузы КАК ФрахтГрузы
	|ГДЕ
	|	ФрахтГрузы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФрахтПланОбработкиСудна.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ФрахтПланОбработкиСудна.Номенклатура КАК Номенклатура,
	|	ФрахтПланОбработкиСудна.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	ФрахтПланОбработкиСудна.Трюм КАК Трюм,
	|	ФрахтПланОбработкиСудна.Количество КАК Количество
	|ПОМЕСТИТЬ ФрахтПланОбработкиСудна
	|ИЗ
	|	Документ.гкс_Фрахт.ПланОбработкиСудна КАК ФрахтПланОбработкиСудна
	|ГДЕ
	|	ФрахтПланОбработкиСудна.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФрахтОчередностьОбработки.ИдентификаторСтрокиПОС КАК ИдентификаторСтрокиПОС,
	|	ФрахтОчередностьОбработки.Порядок КАК Порядок,
	|	ФрахтОчередностьОбработки.Причал КАК Причал
	|ПОМЕСТИТЬ ФрахтОчередностьОбработки
	|ИЗ
	|	Документ.гкс_Фрахт.ОчередностьОбработки КАК ФрахтОчередностьОбработки
	|ГДЕ
	|	ФрахтОчередностьОбработки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФрахтСклады.Склад КАК Склад,
	|	ФрахтСклады.Трюм КАК Трюм,
	|	ФрахтСклады.ПропорцияСмешивания КАК ПропорцияСмешивания
	|ПОМЕСТИТЬ ФрахтСклады
	|ИЗ
	|	Документ.гкс_Фрахт.Склады КАК ФрахтСклады
	|ГДЕ
	|	ФрахтСклады.Ссылка = &Ссылка";

КонецФункции

Процедура ТекстЗапросаТаблицаПланыРазгрузкиСудов(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_ПланыРазгрузкиСудов";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПланыРазгрузкиСудов.Фрахт КАК Фрахт,
	|	ПланыРазгрузкиСудов.Номенклатура КАК Номенклатура,
	|	ПланыРазгрузкиСудов.Трюм КАК Трюм,
	|	ПланыРазгрузкиСудов.Склад КАК Склад,
	|	ПланыРазгрузкиСудов.Количество КАК Количество,
	|	ПланыРазгрузкиСудов.Порядок КАК Порядок,
	|	ПланыРазгрузкиСудов.Причал КАК Причал,
	|	ПланыРазгрузкиСудов.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса
	|ИЗ
	|	РегистрСведений.гкс_ПланыРазгрузкиСудов КАК ПланыРазгрузкиСудов
	|ГДЕ
	|	ЛОЖЬ";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Функция ТекстЗапросаДанныеПоРазгрузкеСудна(НомераТаблиц)

	НомераТаблиц.Вставить("ПланРазгрузкиСудна"		, НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ОчередностьОбработки"	, НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Склады"					, НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	&Ссылка КАК Фрахт,
	|	ФрахтПланОбработкиСудна.Номенклатура КАК Номенклатура,
	|	ФрахтПланОбработкиСудна.ЕдиницаИзмеренияВеса КАК ЕдиницаИзмеренияВеса,
	|	ФрахтПланОбработкиСудна.Трюм КАК Трюм,
	|	ФрахтПланОбработкиСудна.Количество КАК Количество,
	|	ФрахтПланОбработкиСудна.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ФрахтПланОбработкиСудна КАК ФрахтПланОбработкиСудна
	|
	|УПОРЯДОЧИТЬ ПО
	|	Трюм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФрахтОчередностьОбработки.ИдентификаторСтрокиПОС КАК ИдентификаторСтрокиПОС,
	|	ФрахтОчередностьОбработки.Порядок КАК Порядок,
	|	ФрахтОчередностьОбработки.Причал КАК Причал
	|ИЗ
	|	ФрахтОчередностьОбработки КАК ФрахтОчередностьОбработки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФрахтСклады.Склад КАК Склад,
	|	ФрахтСклады.Трюм КАК Трюм,
	|	ФрахтСклады.ПропорцияСмешивания КАК ПропорцияСмешивания
	|ИЗ
	|	ФрахтСклады КАК ФрахтСклады";
	
КонецФункции

Процедура ТекстЗапросаТаблицаСостоянияФрахта(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_СостоянияФрахта";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ФрахтШапка.Период КАК Период,
	|	&Ссылка КАК Фрахт,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияТранспортныхСредств.ВПути) КАК Состояние
	|ИЗ
	|	ФрахтШапка КАК ФрахтШапка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФрахтШапка.ДатаУбытия КАК Период,
	|	&Ссылка КАК Фрахт,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияТранспортныхСредств.Убыл) КАК Состояние
	|ИЗ
	|	ФрахтШапка КАК ФрахтШапка
	|ГДЕ
	|	НЕ ФрахтШапка.ДатаУбытия = &ПустаяДата";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
